LB3.4.JAXWSClientWithHandler/src/main/java/ua/nure/itech/jaxws/service/NewFile.xml

<?xml version="1.0" ?>
<S:Envelope
	xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
	<S:Header>
		<ns2:clientToken
			xmlns:ns2="http://handled.service.jaxws.itech.nure.ua/">
			<token>I_am_client</token>
		</ns2:clientToken>
	</S:Header>
	<S:Body>
		<ns2:helloUser
			xmlns:ns2="http://handled.service.jaxws.itech.nure.ua/">
			<userName>User</userName>
		</ns2:helloUser>
	</S:Body>
</S:Envelope>
--------------------
